           48  :PREFIX:-Customer-Id-X.
               49  :PREFIX:-Customer-Id   PIC 9(08).
           48  :PREFIX:-Customer-Name     PIC X(100).
           48  :PREFIX:-Customer-Address PIC X(100).
           48  :PREFIX:-Customer-Phone    PIC 9(10).
           48  :PREFIX:-Customer-Email    PIC X(100).
