           49  :PREFIX:-Customer-Id       PIC X(10).
           49  :PREFIX:-Customer-Name     PIC X(30).
           49  :PREFIX:-Customer-Address PIC X(50).
           49  :PREFIX:-Customer-Phone    PIC 9(10).
           49  :PREFIX:-Customer-Email    PIC X(40).
